{
    "format": "layers-model",
    "generatedBy": "keras v2.6.0",
    "convertedBy": "TensorFlow.js Converter v3.14.0",
    "modelTopology": {
        "keras_version": "2.6.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [null, 59],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "dense_input"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "batch_input_shape": [null, 59],
                            "dtype": "float32",
                            "units": 128,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": { "seed": null }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 64,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": { "seed": null }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dropout",
                        "config": {
                            "name": "dropout_1",
                            "trainable": true,
                            "dtype": "float32",
                            "rate": 0.5,
                            "noise_shape": null,
                            "seed": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 8,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": { "seed": null }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "SGD",
                "config": {
                    "name": "SGD",
                    "learning_rate": 0.009999999776482582,
                    "decay": 1e-6,
                    "momentum": 0.8999999761581421,
                    "nesterov": true
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": ["group1-shard1of1.bin"],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [59, 128],
                    "dtype": "float32"
                },
                { "name": "dense/bias", "shape": [128], "dtype": "float32" },
                {
                    "name": "dense_1/kernel",
                    "shape": [128, 64],
                    "dtype": "float32"
                },
                { "name": "dense_1/bias", "shape": [64], "dtype": "float32" },
                {
                    "name": "dense_2/kernel",
                    "shape": [64, 8],
                    "dtype": "float32"
                },
                { "name": "dense_2/bias", "shape": [8], "dtype": "float32" }
            ]
        }
    ]
}
